#include <iostream>


int main()
{
    setlocale(LC_ALL, "Russian");
    int K;
    std::cin >> K;

    ///*if (K == 1 || K % 10 == 1)
    //{
    //    std::cout << "Мы нашли" << " " << K << " " << "гриб в лесу";
    //}

    //else if (K > 4 && K < 10 || K % 10 > 4 && K % 10 < 10 || K % 100 > 10 || K % 10 > 10)
    //{
    //    std::cout << "Мы нашли" << " " << K << " " << "грибов в лесу";
    //}

    //else if (K > 1 && K < 5 || K % 10 > 1 && K % 10 < 5)
    //{
    //    std::cout << "Мы нашли" << " " <<*/ K << " " << "гриба в лесу";
    //}
   
    //if(K % 100 < 11 && K % 100 > 14)
    //{
    //    K = K % 10;
    //    if (K > 0 && K < 5)
    //    {
    //        if (K = 1)
    //        {
    //            std::cout << "Мы нашли" << " " << K << " " << "гриб в лесу";
    //        }
    //        if (K > 1 && K < 5)
    //        {
    //            std::cout << "Мы нашли" << " " << K << " " << "гриба в лесу";
    //        }
    //    }
    //    else
    //    {
    //        std::cout << "Мы нашли" << " " << K << " " << "гриба в лесу";
    //    }
    //}
    //else
    //{
    //    std::cout << "Мы нашли" << " " << K << " " << "гриба в лесу";
    //}
    //return 0;


  
    std::cout << "Мы нашли " << K;
    K %= 100;
    
    if (K > 20)
    {
        K %= 10;
    }

    if (K < 20 && K > 10)
    {
        std::cout << " грибов ";
    }

    else if (K < 2 && K > 0)
    {
        std::cout << " гриб ";
    }

    else if (K < 5 && K > 0)
    {
        std::cout << " гриба ";
    }

    else
    {
        std::cout << " грибов ";
    }

    std::cout << "в лесу";
}

